dmgerman/zephyrd3/ext/hal/st/stm32cube/stm32f2xx/drivers/include/stm32f2xx_hal_conf.h
DECL|DATA_CACHE_ENABLE|macro|DATA_CACHE_ENABLE
DECL|DP83848_PHY_ADDRESS|macro|DP83848_PHY_ADDRESS
DECL|ETH_RXBUFNB|macro|ETH_RXBUFNB
DECL|ETH_RX_BUF_SIZE|macro|ETH_RX_BUF_SIZE
DECL|ETH_TXBUFNB|macro|ETH_TXBUFNB
DECL|ETH_TX_BUF_SIZE|macro|ETH_TX_BUF_SIZE
DECL|EXTERNAL_CLOCK_VALUE|macro|EXTERNAL_CLOCK_VALUE
DECL|HAL_ADC_MODULE_ENABLED|macro|HAL_ADC_MODULE_ENABLED
DECL|HAL_CAN_MODULE_ENABLED|macro|HAL_CAN_MODULE_ENABLED
DECL|HAL_CORTEX_MODULE_ENABLED|macro|HAL_CORTEX_MODULE_ENABLED
DECL|HAL_CRC_MODULE_ENABLED|macro|HAL_CRC_MODULE_ENABLED
DECL|HAL_CRYP_MODULE_ENABLED|macro|HAL_CRYP_MODULE_ENABLED
DECL|HAL_DAC_MODULE_ENABLED|macro|HAL_DAC_MODULE_ENABLED
DECL|HAL_DCMI_MODULE_ENABLED|macro|HAL_DCMI_MODULE_ENABLED
DECL|HAL_DMA_MODULE_ENABLED|macro|HAL_DMA_MODULE_ENABLED
DECL|HAL_ETH_MODULE_ENABLED|macro|HAL_ETH_MODULE_ENABLED
DECL|HAL_FLASH_MODULE_ENABLED|macro|HAL_FLASH_MODULE_ENABLED
DECL|HAL_GPIO_MODULE_ENABLED|macro|HAL_GPIO_MODULE_ENABLED
DECL|HAL_HASH_MODULE_ENABLED|macro|HAL_HASH_MODULE_ENABLED
DECL|HAL_HCD_MODULE_ENABLED|macro|HAL_HCD_MODULE_ENABLED
DECL|HAL_I2C_MODULE_ENABLED|macro|HAL_I2C_MODULE_ENABLED
DECL|HAL_I2S_MODULE_ENABLED|macro|HAL_I2S_MODULE_ENABLED
DECL|HAL_IRDA_MODULE_ENABLED|macro|HAL_IRDA_MODULE_ENABLED
DECL|HAL_IWDG_MODULE_ENABLED|macro|HAL_IWDG_MODULE_ENABLED
DECL|HAL_MODULE_ENABLED|macro|HAL_MODULE_ENABLED
DECL|HAL_NAND_MODULE_ENABLED|macro|HAL_NAND_MODULE_ENABLED
DECL|HAL_NOR_MODULE_ENABLED|macro|HAL_NOR_MODULE_ENABLED
DECL|HAL_PCCARD_MODULE_ENABLED|macro|HAL_PCCARD_MODULE_ENABLED
DECL|HAL_PCD_MODULE_ENABLED|macro|HAL_PCD_MODULE_ENABLED
DECL|HAL_PWR_MODULE_ENABLED|macro|HAL_PWR_MODULE_ENABLED
DECL|HAL_RCC_MODULE_ENABLED|macro|HAL_RCC_MODULE_ENABLED
DECL|HAL_RNG_MODULE_ENABLED|macro|HAL_RNG_MODULE_ENABLED
DECL|HAL_RTC_MODULE_ENABLED|macro|HAL_RTC_MODULE_ENABLED
DECL|HAL_SD_MODULE_ENABLED|macro|HAL_SD_MODULE_ENABLED
DECL|HAL_SMARTCARD_MODULE_ENABLED|macro|HAL_SMARTCARD_MODULE_ENABLED
DECL|HAL_SPI_MODULE_ENABLED|macro|HAL_SPI_MODULE_ENABLED
DECL|HAL_SRAM_MODULE_ENABLED|macro|HAL_SRAM_MODULE_ENABLED
DECL|HAL_TIM_MODULE_ENABLED|macro|HAL_TIM_MODULE_ENABLED
DECL|HAL_UART_MODULE_ENABLED|macro|HAL_UART_MODULE_ENABLED
DECL|HAL_USART_MODULE_ENABLED|macro|HAL_USART_MODULE_ENABLED
DECL|HAL_WWDG_MODULE_ENABLED|macro|HAL_WWDG_MODULE_ENABLED
DECL|HSE_STARTUP_TIMEOUT|macro|HSE_STARTUP_TIMEOUT
DECL|HSE_VALUE|macro|HSE_VALUE
DECL|HSI_VALUE|macro|HSI_VALUE
DECL|INSTRUCTION_CACHE_ENABLE|macro|INSTRUCTION_CACHE_ENABLE
DECL|LSE_STARTUP_TIMEOUT|macro|LSE_STARTUP_TIMEOUT
DECL|LSE_VALUE|macro|LSE_VALUE
DECL|LSI_VALUE|macro|LSI_VALUE
DECL|MAC_ADDR0|macro|MAC_ADDR0
DECL|MAC_ADDR1|macro|MAC_ADDR1
DECL|MAC_ADDR2|macro|MAC_ADDR2
DECL|MAC_ADDR3|macro|MAC_ADDR3
DECL|MAC_ADDR4|macro|MAC_ADDR4
DECL|MAC_ADDR5|macro|MAC_ADDR5
DECL|PHY_AUTONEGOTIATION|macro|PHY_AUTONEGOTIATION
DECL|PHY_AUTONEGO_COMPLETE|macro|PHY_AUTONEGO_COMPLETE
DECL|PHY_BCR|macro|PHY_BCR
DECL|PHY_BSR|macro|PHY_BSR
DECL|PHY_CONFIG_DELAY|macro|PHY_CONFIG_DELAY
DECL|PHY_DUPLEX_STATUS|macro|PHY_DUPLEX_STATUS
DECL|PHY_FULLDUPLEX_100M|macro|PHY_FULLDUPLEX_100M
DECL|PHY_FULLDUPLEX_10M|macro|PHY_FULLDUPLEX_10M
DECL|PHY_HALFDUPLEX_100M|macro|PHY_HALFDUPLEX_100M
DECL|PHY_HALFDUPLEX_10M|macro|PHY_HALFDUPLEX_10M
DECL|PHY_ISOLATE|macro|PHY_ISOLATE
DECL|PHY_JABBER_DETECTION|macro|PHY_JABBER_DETECTION
DECL|PHY_LINKED_STATUS|macro|PHY_LINKED_STATUS
DECL|PHY_LINK_INTERRUPT|macro|PHY_LINK_INTERRUPT
DECL|PHY_LINK_STATUS|macro|PHY_LINK_STATUS
DECL|PHY_LOOPBACK|macro|PHY_LOOPBACK
DECL|PHY_MICR_INT_EN|macro|PHY_MICR_INT_EN
DECL|PHY_MICR_INT_OE|macro|PHY_MICR_INT_OE
DECL|PHY_MICR|macro|PHY_MICR
DECL|PHY_MISR_LINK_INT_EN|macro|PHY_MISR_LINK_INT_EN
DECL|PHY_MISR|macro|PHY_MISR
DECL|PHY_POWERDOWN|macro|PHY_POWERDOWN
DECL|PHY_READ_TO|macro|PHY_READ_TO
DECL|PHY_RESET_DELAY|macro|PHY_RESET_DELAY
DECL|PHY_RESET|macro|PHY_RESET
DECL|PHY_RESTART_AUTONEGOTIATION|macro|PHY_RESTART_AUTONEGOTIATION
DECL|PHY_SPEED_STATUS|macro|PHY_SPEED_STATUS
DECL|PHY_SR|macro|PHY_SR
DECL|PHY_WRITE_TO|macro|PHY_WRITE_TO
DECL|PREFETCH_ENABLE|macro|PREFETCH_ENABLE
DECL|TICK_INT_PRIORITY|macro|TICK_INT_PRIORITY
DECL|USE_RTOS|macro|USE_RTOS
DECL|USE_SPI_CRC|macro|USE_SPI_CRC
DECL|VDD_VALUE|macro|VDD_VALUE
DECL|__STM32F2xx_HAL_CONF_H|macro|__STM32F2xx_HAL_CONF_H
DECL|assert_param|macro|assert_param
DECL|assert_param|macro|assert_param
